llm/step_37_flash/b200/bench/bench_random_high.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] `torch_dtype` is deprecated! Use `dtype` instead!
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='stepfun-ai/Step-3.7-Flash-FP8', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot/llm/step_37_flash/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31008/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31008, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='stepfun-ai/Step-3.7-Flash-FP8', served_model_name=None, tokenizer=None, num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=8, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=80, output_file='/data/bbuf/kda-pilot/llm/step_37_flash/b200/bench/random_high.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=0, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 39588
#Output tokens: 382
Starting warmup with 0 sequences...
Warmup completed with 0 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 80        
Successful requests:                     80        
Benchmark duration (s):                  11.63     
Total input tokens:                      39588     
Total input text tokens:                 39588     
Total generated tokens:                  382       
Total generated tokens (retokenized):    357       
Request throughput (req/s):              6.88      
Input token throughput (tok/s):          3404.79   
Output token throughput (tok/s):         32.85     
Peak output token throughput (tok/s):    78.00     
Peak concurrent requests:                80        
Total token throughput (tok/s):          3437.64   
Concurrency:                             57.43     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   8346.58   
Median E2E Latency (ms):                 9012.18   
P90 E2E Latency (ms):                    11617.54  
P99 E2E Latency (ms):                    11619.75  
---------------Time to First Token----------------
Mean TTFT (ms):                          3047.16   
Median TTFT (ms):                        2746.66   
P99 TTFT (ms):                           4130.43   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1580.09   
Median TPOT (ms):                        1357.23   
P99 TPOT (ms):                           3000.80   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           1403.82   
Median ITL (ms):                         1179.88   
P95 ITL (ms):                            2743.78   
P99 ITL (ms):                            2743.91   
Max ITL (ms):                            3572.84   
==================================================